#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/commerceprowess/notejam-infrastructure/runs/run-Ur4TbbZkk1uPeF3z

Waiting for the plan to start...

Terraform v1.1.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.prod_rg will be created
  + resource "azurerm_resource_group" "prod_rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "notejam-prod-rg"
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_database.db will be created
  + resource "azurerm_sql_database" "db" {
      + collation                        = (known after apply)
      + create_mode                      = "Default"
      + creation_date                    = (known after apply)
      + default_secondary_location       = (known after apply)
      + edition                          = (known after apply)
      + elastic_pool_name                = (known after apply)
      + encryption                       = (known after apply)
      + extended_auditing_policy         = (known after apply)
      + id                               = (known after apply)
      + location                         = "westeurope"
      + max_size_bytes                   = (known after apply)
      + max_size_gb                      = (known after apply)
      + name                             = "notejam-db"
      + read_scale                       = false
      + requested_service_objective_id   = (known after apply)
      + requested_service_objective_name = (known after apply)
      + resource_group_name              = "notejam-prod-rg"
      + restore_point_in_time            = (known after apply)
      + server_name                      = "notejam-sqlserver-primary"
      + source_database_deletion_date    = (known after apply)
      + source_database_id               = (known after apply)

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
          + use_server_default         = (known after apply)
        }
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_failover_group.fg will be created
  + resource "azurerm_sql_failover_group" "fg" {
      + databases           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = "notejam-dbfg"
      + resource_group_name = "notejam-prod-rg"
      + role                = (known after apply)
      + server_name         = "notejam-sqlserver-primary"

      + partner_servers {
          + id       = (known after apply)
          + location = (known after apply)
          + role     = (known after apply)
        }

      + read_write_endpoint_failover_policy {
          + grace_minutes = 60
          + mode          = "Automatic"
        }

      + readonly_endpoint_failover_policy {
          + mode = (known after apply)
        }
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_server.primary will be created
  + resource "azurerm_sql_server" "primary" {
      + administrator_login          = (sensitive)
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + extended_auditing_policy     = (known after apply)
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westeurope"
      + name                         = "notejam-sqlserver-primary"
      + resource_group_name          = "notejam-prod-rg"
      + version                      = "12.0"

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

  # module.notejam-sqldb-georeplicated.azurerm_sql_server.secondary will be created
  + resource "azurerm_sql_server" "secondary" {
      + administrator_login          = (sensitive)
      + administrator_login_password = (sensitive value)
      + connection_policy            = "Default"
      + extended_auditing_policy     = (known after apply)
      + fully_qualified_domain_name  = (known after apply)
      + id                           = (known after apply)
      + location                     = "westeurope"
      + name                         = "notejam-sqlserver-secondary"
      + resource_group_name          = "notejam-prod-rg"
      + version                      = "12.0"

      + threat_detection_policy {
          + disabled_alerts            = (known after apply)
          + email_account_admins       = (known after apply)
          + email_addresses            = (known after apply)
          + retention_days             = (known after apply)
          + state                      = (known after apply)
          + storage_account_access_key = (sensitive value)
          + storage_endpoint           = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @marouanabbessi, Action: `pull_request`*